In [1]:
import numpy as np
import pandas as pd

In [4]:
df = pd.read_csv('sample_pivot.csv')
df.head(10)

        Date Region                 Type  Units  Sales
0  7/11/2020   East  Children's Clothing   18.0    306
1  9/23/2020  North  Children's Clothing   14.0    448
2   4/2/2020  South     Women's Clothing   17.0    425
3  2/28/2020   East  Children's Clothing   26.0    832
4  3/19/2020   West     Women's Clothing    3.0     33
5   2/5/2020  North     Women's Clothing   33.0    627
6  1/24/2020  South     Women's Clothing   12.0    396
7  3/25/2020   East     Women's Clothing   29.0    609
8   1/3/2020  North  Children's Clothing   18.0    486
9  11/3/2020   East  Children's Clothing   34.0    374

In [5]:
df.tail()

           Date Region                 Type  Units  Sales
995   2/11/2020   East  Children's Clothing   35.0    735
996  12/25/2020  North       Men's Clothing    NaN   1155
997   8/31/2020  South       Men's Clothing   13.0    208
998   8/23/2020  South     Women's Clothing   17.0    493
999   8/17/2020  North     Women's Clothing   25.0    300

In [6]:
df.head()

        Date Region                 Type  Units  Sales
0  7/11/2020   East  Children's Clothing   18.0    306
1  9/23/2020  North  Children's Clothing   14.0    448
2   4/2/2020  South     Women's Clothing   17.0    425
3  2/28/2020   East  Children's Clothing   26.0    832
4  3/19/2020   West     Women's Clothing    3.0     33

In [7]:
df.isnull().sum()

Date       0
Region     0
Type       0
Units     89
Sales      0
dtype: int64

In [8]:
df2 = df.copy()

In [9]:
df2.dropna(inplace=True)
df2.isnull().sum()

Date      0
Region    0
Type      0
Units     0
Sales     0
dtype: int64

In [10]:
df['Units']= df['Units'].fillna(0)
df.isnull().sum()

Date      0
Region    0
Type      0
Units     0
Sales     0
dtype: int64

In [11]:
# MULTI-LEVEL INDEXING - picking more than one column and turning it to index
# cluster indexx- a column which its index is unique

In [12]:
df.set_index(['Region','Type'],inplace=True)
df.head()

                                 Date  Units  Sales
Region Type
East   Children's Clothing  7/11/2020   18.0    306
North  Children's Clothing  9/23/2020   14.0    448
South  Women's Clothing      4/2/2020   17.0    425
East   Children's Clothing  2/28/2020   26.0    832
West   Women's Clothing     3/19/2020    3.0     33

In [13]:
df.loc['East']

                           Date  Units  Sales
Type
Children's Clothing   7/11/2020   18.0    306
Children's Clothing   2/28/2020   26.0    832
Women's Clothing      3/25/2020   29.0    609
Children's Clothing   11/3/2020   34.0    374
Men's Clothing         5/1/2020   10.0    140
...                         ...    ...    ...
Men's Clothing        3/20/2020   14.0    238
Children's Clothing    6/5/2020   11.0    220
Men's Clothing         5/4/2020    6.0    108
Women's Clothing     10/18/2020   19.0    399
Children's Clothing   2/11/2020   35.0    735

[411 rows x 3 columns]

In [15]:
df.loc['East'].loc['Women\'s Clothing']

                        Date  Units  Sales
Type
Women's Clothing   3/25/2020   29.0    609
Women's Clothing   6/12/2020   35.0   1050
Women's Clothing   6/29/2020   24.0    504
Women's Clothing  12/20/2020   30.0    930
Women's Clothing    6/6/2020   28.0    560
...                      ...    ...    ...
Women's Clothing  10/25/2020   26.0    336
Women's Clothing  10/18/2020   13.0    338
Women's Clothing   9/17/2020   17.0    161
Women's Clothing   8/19/2020   24.0    384
Women's Clothing  10/18/2020   19.0    399

[176 rows x 3 columns]

In [16]:
df.loc['East'].loc['Children\'s Clothing']

                          Date  Units  Sales
Type
Children's Clothing  7/11/2020   18.0    306
Children's Clothing  2/28/2020   26.0    832
Children's Clothing  11/3/2020   34.0    374
Children's Clothing  8/11/2020   12.0    348
Children's Clothing  7/10/2020   10.0    310
...                        ...    ...    ...
Children's Clothing  2/18/2020   34.0    713
Children's Clothing  11/5/2020   14.0    578
Children's Clothing  1/16/2020   27.0    476
Children's Clothing   6/5/2020   11.0    220
Children's Clothing  2/11/2020   35.0    735

[113 rows x 3 columns]

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 1000 entries, ('East', "Children's Clothing") to ('North', "Women's Clothing")
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1000 non-null   object
 1   Units   1000 non-null   float64
 2   Sales   1000 non-null   int64
dtypes: float64(1), int64(1), object(1)
memory usage: 25.8+ KB

In [18]:
df.reset_index(inplace=True)
df.head()

  Region                 Type       Date  Units  Sales
0   East  Children's Clothing  7/11/2020   18.0    306
1  North  Children's Clothing  9/23/2020   14.0    448
2  South     Women's Clothing   4/2/2020   17.0    425
3   East  Children's Clothing  2/28/2020   26.0    832
4   West     Women's Clothing  3/19/2020    3.0     33

In [19]:
df.min(axis =0)

Region                   East
Type      Children's Clothing
Date                 1/1/2020
Units                     0.0
Sales                      33
dtype: object

In [20]:
df.transpose()

,0,1,2,3,4,5,6,7,8,9,...,990,991,992,993,994,995,996,997,998,999
Region,East,North,South,East,West,North,South,East,North,East,...,North,West,South,North,East,East,North,South,South,North
Type,Children's Clothing,Children's Clothing,Women's Clothing,Children's Clothing,Women's Clothing,Women's Clothing,Women's Clothing,Women's Clothing,Children's Clothing,Children's Clothing,...,Children's Clothing,Men's Clothing,Women's Clothing,Women's Clothing,Women's Clothing,Children's Clothing,Men's Clothing,Men's Clothing,Women's Clothing,Women's Clothing
Date,7/11/2020,9/23/2020,4/2/2020,2/28/2020,3/19/2020,2/5/2020,1/24/2020,3/25/2020,1/3/2020,11/3/2020,...,12/17/2020,11/17/2020,4/15/2020,6/23/2020,10/18/2020,2/11/2020,12/25/2020,8/31/2020,8/23/2020,8/17/2020
Units,18.0,14.0,17.0,26.0,3.0,33.0,12.0,29.0,18.0,34.0,...,7.0,27.0,25.0,12.0,19.0,35.0,0.0,13.0,17.0,25.0
Sales,306,448,425,832,33,627,396,609,486,374,...,217,486,750,192,399,735,1155,208,493,300

In [21]:
df.sort_values('Sales',ascending = True,ignore_index=True,inplace=True)
df.head()

  Region                 Type       Date  Units  Sales
0   West     Women's Clothing  3/19/2020    3.0     33
1   East       Men's Clothing  4/24/2020   28.0     36
2   East       Men's Clothing  1/17/2020   14.0     36
3   East  Children's Clothing   3/2/2020   31.0     36
4   East       Men's Clothing  2/28/2020   34.0     39

In [23]:
df.apply('count')

Region    1000
Type      1000
Date      1000
Units     1000
Sales     1000
dtype: int64

In [24]:
df.groupby('Region').apply(max)

       Region              Type      Date  Units  Sales
Region
East     East  Women's Clothing  9/9/2020   35.0   1122
North   North  Women's Clothing  9/8/2020   35.0   1155
South   South  Women's Clothing  9/4/2020   35.0   1122
West     West  Women's Clothing  9/8/2020   35.0   1023

In [25]:
#Pivot table is used for descriptive analysis
#

In [27]:
df_pv = pd.pivot_table(df,index = 'Region',columns='Type',values=['Units','Sales'],aggfunc='max')
df_pv

                     Sales                                  \
Type   Children's Clothing Men's Clothing Women's Clothing
Region
East                  1122           1054             1054
North                 1088           1155             1122
South                  924           1085             1122
West                   992            930             1023

                     Units
Type   Children's Clothing Men's Clothing Women's Clothing
Region
East                  35.0           35.0             35.0
North                 35.0            0.0             35.0
South                 35.0           34.0             35.0
West                  34.0           35.0             33.0

In [28]:
df_pv = pd.pivot_table(df,index = 'Region',columns='Type',values=['Sales'],aggfunc='max')
df_pv

                     Sales
Type   Children's Clothing Men's Clothing Women's Clothing
Region
East                  1122           1054             1054
North                 1088           1155             1122
South                  924           1085             1122
West                   992            930             1023

In [29]:
df_pv = pd.pivot_table(df,index = 'Region',columns='Type',values=['Sales'],aggfunc='sum')
df_pv

                     Sales
Type   Children's Clothing Men's Clothing Women's Clothing
Region
East                 45849          51685            70229
North                37306          39975            61419
South                18570          18542            22203
West                 20182          19077            22217

In [30]:
df_pv = pd.pivot_table(df,index = 'Region',columns='Type',values=['Sales'],aggfunc='sum',margins=True,margins_name='TotalSales')
df_pv

                         Sales
Type       Children's Clothing Men's Clothing Women's Clothing TotalSales
Region
East                     45849          51685            70229     167763
North                    37306          39975            61419     138700
South                    18570          18542            22203      59315
West                     20182          19077            22217      61476
TotalSales              121907         129279           176068     427254

In [31]:
pd.crosstab(df['Region'],df['Type'],margins=True)

Type    Children's Clothing  Men's Clothing  Women's Clothing   All
Region
East                    113             122               176   411
North                    85              89               142   316
South                    45              39                53   137
West                     42              41                53   136
All                     285             291               424  1000

In [32]:
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Region  1000 non-null   object
 1   Type    1000 non-null   object
 2   Date    1000 non-null   datetime64[ns]
 3   Units   1000 non-null   float64
 4   Sales   1000 non-null   int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 39.2+ KB

In [33]:
df.sort_values('Date',ignore_index=True,inplace=True)

In [35]:
df[df['Sales']>=700]

    Region                 Type       Date  Units  Sales
8    South     Women's Clothing 2020-01-03   13.0    750
13   North     Women's Clothing 2020-01-05   18.0    960
19   North     Women's Clothing 2020-01-08   18.0   1054
34    West  Children's Clothing 2020-01-14    6.0    900
36   North     Women's Clothing 2020-01-14    8.0    726
..     ...                  ...        ...    ...    ...
966  North     Women's Clothing 2020-12-21   11.0   1056
976   East  Children's Clothing 2020-12-24    7.0    924
977  North       Men's Clothing 2020-12-25    0.0   1155
986  North       Men's Clothing 2020-12-28    0.0    825
996   West     Women's Clothing 2020-12-30   24.0    704

[178 rows x 5 columns]

In [37]:
df[(df['Sales']>=700)&(df['Units']>18)]

    Region                 Type       Date  Units  Sales
40    East     Women's Clothing 2020-01-15   21.0    768
42    East  Children's Clothing 2020-01-16   32.0    744
48   North  Children's Clothing 2020-01-17   25.0    825
69    East  Children's Clothing 2020-01-25   30.0    884
99    East       Men's Clothing 2020-02-04   25.0    700
..     ...                  ...        ...    ...    ...
921  North     Women's Clothing 2020-12-07   24.0   1056
926   East  Children's Clothing 2020-12-09   23.0   1122
963   East     Women's Clothing 2020-12-20   30.0    930
964  North     Women's Clothing 2020-12-20   29.0    748
996   West     Women's Clothing 2020-12-30   24.0    704

[84 rows x 5 columns]

In [38]:
df[(df['Date']>pd.Timestamp(2020,1,1))&(df['Date']<pd.Timestamp(2020,2,28))&(df['Sales']>=700)&(df['Units']>=18)]

    Region                 Type       Date  Units  Sales
13   North     Women's Clothing 2020-01-05   18.0    960
19   North     Women's Clothing 2020-01-08   18.0   1054
40    East     Women's Clothing 2020-01-15   21.0    768
42    East  Children's Clothing 2020-01-16   32.0    744
48   North  Children's Clothing 2020-01-17   25.0    825
69    East  Children's Clothing 2020-01-25   30.0    884
99    East       Men's Clothing 2020-02-04   25.0    700
106   East       Men's Clothing 2020-02-06   33.0    725
111   West       Men's Clothing 2020-02-08   32.0    928
116   East  Children's Clothing 2020-02-11   35.0    735
118  South     Women's Clothing 2020-02-12   34.0    759
127   West  Children's Clothing 2020-02-14   30.0    910
134   West       Men's Clothing 2020-02-17   27.0    891
136   East  Children's Clothing 2020-02-18   34.0    713
138   West       Men's Clothing 2020-02-19   23.0    780